Total Time Spent :13hr 40min
** TODO TEJ
  A function-as-association between elements of a domain and elements of a
  codomain, for \ldquo{}small\rdquo domains and codomains, inspired so-called \ldquo{}association
  lists\rdquo (or alists) and the =assoc= (and associated) functions.

  =(assoc KEY LIST)= returns non-nil if KEY is \ldquo{}equal\rdquo to the first element of
  an element of LIST. The value is actually the first element of LIST whose
  first element equals KEY.

  For example, here is a function that uses an alist to look up the RGB values
  of a given color name:

#+BEGIN_SRC emacs-lisp :results silent
  (defun lookup-rgb (color-name)
    (rest (assoc color-name
                 '(("red" 255 0 0) ("green" 0 255 0) ("blue" 0 0 255)))))
#+END_SRC

#+BEGIN_SRC emacs-lisp :results raw
  (lookup-rgb "blue")
#+END_SRC

#+RESULTS:
(0 0 255)

: (0 0 255)

  What if the color name is not in the alist?

#+BEGIN_SRC emacs-lisp :results raw
  (lookup-rgb "grue")
#+END_SRC

#+RESULTS:
nil

: nil

  There are several variations of =assoc=. Find and give examples of using them.

*** Your answer goes here.
1. The first I found is rassoc. It compares the cdr to your input.
#+BEGIN_SRC emacs-lisp :results raw
(setq myQ '(1 3 5))
(car (rassoc myQ
  '(("first three odds" 1 3 5) ("first three evens" 2 4 6))))
#+END_SRC

#+RESULTS:
first three odds

2. Another version is assq, which is faster, but you have to set up key values
for it to work properly.
#+BEGIN_SRC emacs-lisp :results raw
(setq anotherQ '((transformer . optimusprime) (avenger . warmachine)))
(assq 'avenger anotherQ)
#+END_SRC

#+RESULTS:
(avenger . warmachine)

3. Finally there is an rassq which finds values based on the key/value pairing.
#+BEGIN_SRC emacs-lisp :results raw
(setq finalQ '((sport . volleyball) (game . monopoly)))
(rassq 'monopoly finalQ)
#+END_SRC

#+RESULTS:
(game . monopoly)

** TODO WFK
  In the function-as-map context, here is another interpretation:

  A \ldquo{}map\rdquo type (AKA associative array, AKA hashtable) is found in many
  languages. For example, C++:
#+BEGIN_SRC C++ :results output
  #include <iostream>
  #include <map>
  using namespace std;

  int main() {
     map<string, string> mymap;

     mymap["one"] = "red";
     mymap["two"] = "blue";
     mymap["three"] = "green";

     for (auto const &ent1 : mymap) {
        cout << ent1.first << " : " << ent1.second << endl;
     }
  }
#+END_SRC

: one : red
: three : green
: two : blue

  And python:
#+BEGIN_SRC python :results output
  mymap = {}

  mymap["one"] = "red"
  mymap["two"] = "blue"
  mymap["three"] = "green"

  if __name__ == "__main__":
          for key in mymap.keys():
                  print key + " : " + str(mymap[key])
#+END_SRC

#+RESULTS:

: three : green
: two : blue
: one : red

  And of course elisp:
#+BEGIN_SRC emacs-lisp :results output
  (let* ((mymap (make-hash-table)))
    (puthash "one" "red" mymap)
    (puthash "two" "blue" mymap)
    (puthash "three" "green" mymap)
    (pp (list (gethash "one" mymap)
              (gethash "two" mymap)
              (gethash "three" mymap)))
    (maphash (lambda (key value) (princ (format "%s : %s\n" key value))) mymap))
#+END_SRC

#+RESULTS:
: (nil nil nil)
: one : red
: two : blue
: three : green

: ("red" "blue" "green")
: one : red
: two : blue
: three : green

  What happens if you omit the =:test 'equal= parameters to the
  =make-hash-table= call?
  
** TODO TER
  This exercise explores /looping/ versus /mapping/.

  What does the =morphify= function defined below do? Think about it, then PVP
  the result of the call to it that follows.

Well it loops through every item in lst.
It then calls a function called collect, so I assume
it changes a list depending on what is given in the 
input, and puts it into a collection of results.
#+BEGIN_SRC emacs-lisp :results silent
  (defun morphify (fun lst)
    (loop for item in lst
          collect (funcall fun item)))
#+END_SRC
Builds our function.
  Note the quotes: Must mean separate items.

This will make every letter in every word lowercase if what I 
predicted is true.
#+BEGIN_SRC emacs-lisp :results raw
  (morphify (quote downcase) (quote ("THIS" "IS" "TOO" "LOUD")))
#+END_SRC

#+RESULTS:
(this is too loud)
Correct, sort of. I did not realize it is a mapping function. It takes
in a function and lst. I did not realize they were 2 separate parameters.
Still getting used to lisp.

  The =morphify= function is essentially a /mapping/ function, which means it
  takes a passed-in function (=fun=) and a passed-in list (=lst=), and /maps fun
  over lst/, i.e., the results of calling the function =fun= on each element of
  the list =lst= are collected into a new list, which is returned.

  This shows one way (iteratively) a /map/ function could be implemented.
  Another way is /recursively/, as in:

#+BEGIN_SRC emacs-lisp :results silent
  (defun morphifyr (fun lst)
    (if (null lst)
        nil
      (append (list (funcall fun (first lst))) (morphifyr fun (rest lst)))))
#+END_SRC

  Explain how this version of =morphify= works.
  
*** Your answer goes here
This version also takes in a function and a list. It first checks if the value
of lst is null, if not then it appends the first item in lst to a new list with 
the function applied to it and then returns the rest of the list recursively
into the morphifyr function again. So it gets through the whole list. Lets
test it.

#+BEGIN_SRC emacs-lisp :results raw
(morphify (quote upcase) (quote ("i love elisp")))
#+END_SRC

#+RESULTS:
(I LOVE ELISP)

We were correct, it uppercased the whole list recursively, rather than in a loop.

** TODO TGE
  Note the difference if -13 is used instead of 13 below:
#+BEGIN_SRC emacs-lisp :results silent
  (defun compute-floor-the-hard-way (dividend divisor)
    (- (/ dividend (float divisor)) (/ (mod dividend divisor) (float divisor))))
#+END_SRC

#+BEGIN_SRC emacs-lisp :results raw
  (let* ((number (/ -13 4.0))
         (floor1 (floor number))
         (floor2 (compute-floor-the-hard-way -13 4.0)))
    (list number floor1 floor2))
#+END_SRC

#+RESULTS:
(-3.25 -4 -4.0)
(3.25 3 3.0)

: (3.25 3 3.0)

  Is the hard way correct?
  
** Factorial Function
#+BEGIN_SRC emacs-lisp :results silent
(defun factorial (myNum)
   (setf acc 1)
   (loop for x from 1 to myNum
      do(setq acc (* acc x)))
    (print acc))
#+END_SRC

#+BEGIN_SRC emacs-lisp :results raw
 (list (factorial 5) (factorial 12) (factorial 0))
#+END_SRC

#+RESULTS:
(120 479001600 1)



** Function That Uses a Loop
Well, my factorial function uses a loop but I'll make a new one.

A random function, but it uses a traditional loop. It sums up the numbers
from 1 to whatever times you put in, each multiplied by the value you pass.
#+BEGIN_SRC emacs-lisp :results silent
(defun mySweetFunction (times val)
   (loop for x from 1 to times
      sum (* x val)))
#+END_SRC

#+BEGIN_SRC emacs-lisp :results raw
(mySweetFunction 30 3)
#+END_SRC

#+RESULTS:
1395
